# Базовый SQL

В самостоятельном проекте вам нужно проанализировать данные о фондах и инвестициях и написать запросы к базе. Задания будут постепенно усложняться, но всё необходимое для их выполнения: операторы, функции, методы работы с базой — вы уже изучили на курсе. К каждому заданию будет небольшая подсказка: она направит вас в нужную сторону, но подробного плана действий не предложит.

<img 
     src="other/images/project5.png" 
     height="800" 
     width="800" />

**`acquisition`**

Содержит информацию о покупках одних компаний другими.

* первичный ключ id — идентификатор или уникальный номер покупки;
* внешний ключ acquiring_company_id — ссылается на таблицу company — идентификатор компании-покупателя, то есть той, что покупает другую компанию;
* внешний ключ acquired_company_id — ссылается на таблицу company — идентификатор компании, которую покупают;
* term_code — способ оплаты сделки:
    * cash — наличными;
    * stock — акциями компании;
    * cash_and_stock — смешанный тип оплаты: наличные и акции.
* price_amount — сумма покупки в долларах;
* acquired_at — дата совершения сделки;
* created_at — дата и время создания записи в таблице;
* updated_at — дата и время обновления записи в таблице.

**`company`**

Содержит информацию о компаниях-стартапах.

* первичный ключ id — идентификатор, или уникальный номер компании;
* name — название компании;
* category_code — категория деятельности компании, например:
    * news — специализируется на работе с новостями;
    * social — специализируется на социальной работе.
* status — статус компании:
    * acquired — приобретена;
    * operating — действует;
    * ipo — вышла на IPO;
    * closed — перестала существовать.
* founded_at — дата основания компании;
* closed_at — дата закрытия компании, которую указывают в том случае, если компании больше не существует;
* domain — домен сайта компании;
* network_username — профиль фонда в корпоративной сети биржи;
* country_code — код страны, например, USA для США, GBR для Великобритании;
* investment_rounds — число раундов, в которых компания участвовала как инвестор;
* funding_rounds — число раундов, в которых компания привлекала инвестиции;
* funding_total — сумма привлечённых инвестиций в долларах;
* milestones — количество важных этапов в истории компании;
* created_at — дата и время создания записи в таблице;
* updated_at — дата и время обновления записи в таблице.

**`education`**

Хранит информацию об уровне образования сотрудников компаний.

* первичный ключ id — уникальный номер записи с информацией об образовании;
* внешний ключ person_id — ссылается на таблицу people — идентификатор человека, информация о котором представлена в записи;
* degree_type — учебная степень, например:
    * BA — Bachelor of Arts — бакалавр гуманитарных наук;
    * MS — Master of Science — магистр естественных наук.
* instituition — учебное заведение, название университета;
* graduated_at — дата завершения обучения, выпуска;
* created_at — дата и время создания записи в таблице;
* updated_at — дата и время обновления записи в таблице.

**`fund`**

Хранит информацию о венчурных фондах. 

* первичный ключ id — уникальный номер венчурного фонда;
* name — название венчурного фонда;
* founded_at — дата основания фонда;
* domain — домен сайта фонда;
* network_username — профиль фонда в корпоративной сети биржи;
* country_code — код страны фонда;
* investment_rounds — число инвестиционных раундов, в которых фонд принимал участие;
* invested_companies — число компаний, в которые инвестировал фонд;
* milestones — количество важных этапов в истории фонда;
* created_at — дата и время создания записи в таблице;
* updated_at — дата и время обновления записи в таблице.

**`funding_round`**

Содержит информацию о раундах инвестиций. 

* первичный ключ id — уникальный номер инвестиционного раунда;
* внешний ключ company_id — ссылается на таблицу company — уникальный номер компании, участвовавшей в инвестиционном раунде;
* funded_at — дата проведения раунда;
* funding_round_type — тип инвестиционного раунда, например:
    * venture — венчурный раунд;
    * angel — ангельский раунд;
    * series_a — раунд А.
* raised_amount — сумма инвестиций, которую привлекла компания в этом раунде в долларах;
* pre_money_valuation — предварительная, проведённая до инвестиций оценка стоимости компании в долларах;
* participants — количество участников инвестиционного раунда;
* is_first_round — является ли этот раунд первым для компании;
* is_last_round — является ли этот раунд последним для компании;
* created_at — дата и время создания записи в таблице;
* updated_at — дата и время обновления записи в таблице.

**`investment`**

Содержит информацию об инвестициях венчурных фондов в компании-стартапы.

* первичный ключ id — уникальный номер инвестиции;
* внешний ключ funding_round_id — ссылается на таблицу funding_round — уникальный номер раунда инвестиции;
* внешний ключ company_id — ссылается на таблицу company — уникальный номер компании-стартапа, в которую инвестируют;
* внешний ключ fund_id — ссылается на таблицу fund — уникальный номер фонда, инвестирующего в компанию-стартап;
* created_at — дата и время создания записи в таблице;
* updated_at — дата и время обновления записи в таблице.

**`people`**

Содержит информацию о сотрудниках компаний-стартапов.

* первичный ключ id — уникальный номер сотрудника;
* first_name — имя сотрудника;
* last_name — фамилия сотрудника;
* внешний ключ company_id — ссылается на таблицу company — уникальный номер компании-стартапа;
* network_username — профиль фонда в корпоративной сети биржи;
* created_at — дата и время создания записи в таблице;
* updated_at — дата и время обновления записи в таблице.

## Задача 1

Отобразите все записи из таблицы company по компаниям, которые закрылись.

In [1]:
'''
SELECT *
FROM company AS c
WHERE status IN ('closed');
'''

"\nSELECT *\nFROM company AS c\nWHERE status IN ('closed');\n"

## Задача 2

Отобразите количество привлечённых средств для новостных компаний США. Используйте данные из таблицы company. Отсортируйте таблицу по убыванию значений в поле funding_total.

In [2]:
'''
SELECT c.funding_total
FROM company as c
WHERE c.category_code IN ('news')
  AND c.country_code IN ('USA')
ORDER BY c.funding_total DESC;
'''

"\nSELECT c.funding_total\nFROM company as c\nWHERE c.category_code IN ('news')\n  AND c.country_code IN ('USA')\nORDER BY c.funding_total DESC;\n"

## Задача 3

Найдите общую сумму сделок по покупке одних компаний другими в долларах. Отберите сделки, которые осуществлялись только за наличные с 2011 по 2013 год включительно.

In [3]:
'''
SELECT SUM(a.price_amount)
FROM acquisition AS a
WHERE a.term_code IN ('cash')
  AND EXTRACT(YEAR FROM CAST(a.acquired_at AS timestamp)) BETWEEN 2011 AND 2013;
'''

"\nSELECT SUM(a.price_amount)\nFROM acquisition AS a\nWHERE a.term_code IN ('cash')\n  AND EXTRACT(YEAR FROM CAST(a.acquired_at AS timestamp)) BETWEEN 2011 AND 2013;\n"

## Задача 4

Отобразите имя, фамилию и названия аккаунтов людей в поле network_username, у которых названия аккаунтов начинаются на 'Silver'.

In [4]:
'''
SELECT p.first_name,
       p.last_name,
       p.network_username
FROM people AS p
WHERE p.network_username LIKE 'Silver%';
'''

"\nSELECT p.first_name,\n       p.last_name,\n       p.network_username\nFROM people AS p\nWHERE p.network_username LIKE 'Silver%';\n"

## Задача 5

Выведите на экран всю информацию о людях, у которых названия аккаунтов в поле network_username содержат подстроку 'money', а фамилия начинается на 'K'.

In [5]:
'''
SELECT *
FROM people AS p
WHERE p.network_username LIKE '%money%'
    AND p.last_name LIKE 'K%';
'''

"\nSELECT *\nFROM people AS p\nWHERE p.network_username LIKE '%money%'\n    AND p.last_name LIKE 'K%';\n"

## Задача 6

Для каждой страны отобразите общую сумму привлечённых инвестиций, которые получили компании, зарегистрированные в этой стране. Страну, в которой зарегистрирована компания, можно определить по коду страны. Отсортируйте данные по убыванию суммы.

In [6]:
'''
SELECT c.country_code AS country,
       SUM(c.funding_total) AS sum_investment
FROM company as c
GROUP BY c.country_code
ORDER BY sum_investment DESC;
'''

'\nSELECT c.country_code AS country,\n       SUM(c.funding_total) AS sum_investment\nFROM company as c\nGROUP BY c.country_code\nORDER BY sum_investment DESC;\n'

## Задача 7

Составьте таблицу, в которую войдёт дата проведения раунда, а также минимальное и максимальное значения суммы инвестиций, привлечённых в эту дату.

Оставьте в итоговой таблице только те записи, в которых минимальное значение суммы инвестиций не равно нулю и не равно максимальному значению.

In [7]:
'''
SELECT CAST(fr.funded_at AS date) AS date_round,
       MIN(fr.raised_amount) AS min_raised_amount,
       MAX(fr.raised_amount) AS max_raised_amount
FROM funding_round AS fr
GROUP BY date_round
HAVING MIN(fr.raised_amount) NOT IN (0, MAX(fr.raised_amount));
'''

'\nSELECT CAST(fr.funded_at AS date) AS date_round,\n       MIN(fr.raised_amount) AS min_raised_amount,\n       MAX(fr.raised_amount) AS max_raised_amount\nFROM funding_round AS fr\nGROUP BY date_round\nHAVING MIN(fr.raised_amount) NOT IN (0, MAX(fr.raised_amount));\n'

## Задача 8

Создайте поле с категориями:

* Для фондов, которые инвестируют в 100 и более компаний, назначьте категорию high_activity.
* Для фондов, которые инвестируют в 20 и более компаний до 100, назначьте категорию middle_activity.
* Если количество инвестируемых компаний фонда не достигает 20, назначьте категорию low_activity.

Отобразите все поля таблицы fund и новое поле с категориями.

In [8]:
'''
SELECT *,
       CASE 
           WHEN f.invested_companies >= 100 THEN 'high_activity'
           WHEN f.invested_companies >= 20 AND f.invested_companies <= 100 THEN 'middle_activity'
           ELSE 'low_activity'
        END AS category
FROM fund AS f; 
'''

"\nSELECT *,\n       CASE \n           WHEN f.invested_companies >= 100 THEN 'high_activity'\n           WHEN f.invested_companies >= 20 AND f.invested_companies <= 100 THEN 'middle_activity'\n           ELSE 'low_activity'\n        END AS category\nFROM fund AS f; \n"

## Задача 9

Для каждой из категорий, назначенных в предыдущем задании, посчитайте округлённое до ближайшего целого числа среднее количество инвестиционных раундов, в которых фонд принимал участие. Выведите на экран категории и среднее число инвестиционных раундов. Отсортируйте таблицу по возрастанию среднего.

In [9]:
'''
SELECT CASE
           WHEN f.invested_companies >= 100 THEN 'high_activity'
           WHEN f.invested_companies >= 20 THEN 'middle_activity'
           ELSE 'low_activity'
       END AS activity_category,
       ROUND(AVG(f.investment_rounds)) AS avg_rounds
FROM fund AS f
GROUP BY activity_category
ORDER BY avg_rounds ASC;
'''

"\nSELECT CASE\n           WHEN f.invested_companies >= 100 THEN 'high_activity'\n           WHEN f.invested_companies >= 20 THEN 'middle_activity'\n           ELSE 'low_activity'\n       END AS activity_category,\n       ROUND(AVG(f.investment_rounds)) AS avg_rounds\nFROM fund AS f\nGROUP BY activity_category\nORDER BY avg_rounds ASC;\n"

## Задача 10

Проанализируйте, в каких странах находятся фонды, которые чаще всего инвестируют в стартапы. 

Для каждой страны посчитайте минимальное, максимальное и среднее число компаний, в которые инвестировали фонды этой страны, основанные с 2010 по 2012 год включительно. Исключите страны с фондами, у которых минимальное число компаний, получивших инвестиции, равно нулю. 

Выгрузите десять самых активных стран-инвесторов: отсортируйте таблицу по среднему количеству компаний от большего к меньшему. Затем добавьте сортировку по коду страны в лексикографическом порядке.

In [10]:
'''
SELECT f.country_code AS country,
       MIN(f.invested_companies) AS min_inv_companies,
       MAX(f.invested_companies) AS max_inv_companies,
       AVG(f.invested_companies) AS avg_inv_companies
FROM fund AS f
WHERE EXTRACT(YEAR FROM CAST(f.founded_at AS timestamp)) BETWEEN 2010 AND 2012
GROUP BY country
HAVING MIN(f.invested_companies) NOT IN (0)
ORDER BY avg_inv_companies DESC, country ASC
LIMIT 10;
'''

'\nSELECT f.country_code AS country,\n       MIN(f.invested_companies) AS min_inv_companies,\n       MAX(f.invested_companies) AS max_inv_companies,\n       AVG(f.invested_companies) AS avg_inv_companies\nFROM fund AS f\nWHERE EXTRACT(YEAR FROM CAST(f.founded_at AS timestamp)) BETWEEN 2010 AND 2012\nGROUP BY country\nHAVING MIN(f.invested_companies) NOT IN (0)\nORDER BY avg_inv_companies DESC, country ASC\nLIMIT 10;\n'

## Задача 11

Отобразите имя и фамилию всех сотрудников стартапов. Добавьте поле с названием учебного заведения, которое окончил сотрудник, если эта информация известна.

In [11]:
'''
SELECT p.first_name,
       p.last_name,
       t_1.instituition
FROM people AS p
LEFT JOIN (SELECT e.id,
                  e.instituition
           FROM education AS e) AS t_1 ON t_1.id = p.id;
'''

'\nSELECT p.first_name,\n       p.last_name,\n       t_1.instituition\nFROM people AS p\nLEFT JOIN (SELECT e.id,\n                  e.instituition\n           FROM education AS e) AS t_1 ON t_1.id = p.id;\n'

## Задача 12

Для каждой компании найдите количество учебных заведений, которые окончили её сотрудники. Выведите название компании и число уникальных названий учебных заведений. Составьте топ-5 компаний по количеству университетов.

In [12]:
'''
SELECT c.name, 
       COUNT(DISTINCT t_2.instituition)
FROM company AS c
LEFT JOIN 
         (SELECT t_1.instituition,
                 p.company_id
          FROM       
               (SELECT person_id,
                       instituition 
                FROM education 
                WHERE instituition IS NOT NULL
               ) AS t_1
          INNER JOIN  people AS p ON p.id = t_1.person_id
         ) AS t_2 ON t_2.company_id = c.id
GROUP BY c.name
ORDER BY COUNT(DISTINCT t_2.instituition) DESC
LIMIT 5;
'''

'\nSELECT c.name, \n       COUNT(DISTINCT t_2.instituition)\nFROM company AS c\nLEFT JOIN \n         (SELECT t_1.instituition,\n                 p.company_id\n          FROM       \n               (SELECT person_id,\n                       instituition \n                FROM education \n                WHERE instituition IS NOT NULL\n               ) AS t_1\n          INNER JOIN  people AS p ON p.id = t_1.person_id\n         ) AS t_2 ON t_2.company_id = c.id\nGROUP BY c.name\nORDER BY COUNT(DISTINCT t_2.instituition) DESC\nLIMIT 5;\n'

## Задача 13

Составьте список с уникальными названиями закрытых компаний, для которых первый раунд финансирования оказался последним.

In [13]:
'''
SELECT t_1.name AS company_name
FROM (SELECT c.id,
             c.name,
             c.status
      FROM company AS c
      GROUP BY c.id, c.name, c.status
      HAVING c.status IN ('closed')) AS t_1
JOIN (SELECT fr.company_id,
             fr.is_first_round,
             fr.is_last_round
      FROM funding_round AS fr
      GROUP BY fr.company_id, fr.is_first_round, fr.is_last_round
      HAVING fr.is_first_round IN (1)
         AND fr.is_last_round IN (1)) AS t_2 ON t_2.company_id = t_1.id;
'''

"\nSELECT t_1.name AS company_name\nFROM (SELECT c.id,\n             c.name,\n             c.status\n      FROM company AS c\n      GROUP BY c.id, c.name, c.status\n      HAVING c.status IN ('closed')) AS t_1\nJOIN (SELECT fr.company_id,\n             fr.is_first_round,\n             fr.is_last_round\n      FROM funding_round AS fr\n      GROUP BY fr.company_id, fr.is_first_round, fr.is_last_round\n      HAVING fr.is_first_round IN (1)\n         AND fr.is_last_round IN (1)) AS t_2 ON t_2.company_id = t_1.id;\n"

## Задача 14

Составьте список уникальных номеров сотрудников, которые работают в компаниях, отобранных в предыдущем задании.

In [14]:
'''
SELECT t_1.id AS unique_number_employee
FROM (SELECT p.id,
             p.company_id
      FROM people AS p
      GROUP BY p.id, p.company_id) AS t_1
      
JOIN (SELECT c.id,
             c.name,
             c.status
      FROM company AS c
      GROUP BY c.id, c.name, c.status
      HAVING c.status IN ('closed')) AS t_2 ON t_2.id = t_1.company_id

JOIN (SELECT fr.company_id,
             fr.is_first_round,
             fr.is_last_round
      FROM funding_round AS fr
      GROUP BY fr.company_id, fr.is_first_round, fr.is_last_round
      HAVING fr.is_first_round IN (1)
         AND fr.is_last_round IN (1)) AS t_3 ON t_3.company_id = t_2.id;
'''

"\nSELECT t_1.id AS unique_number_employee\nFROM (SELECT p.id,\n             p.company_id\n      FROM people AS p\n      GROUP BY p.id, p.company_id) AS t_1\n      \nJOIN (SELECT c.id,\n             c.name,\n             c.status\n      FROM company AS c\n      GROUP BY c.id, c.name, c.status\n      HAVING c.status IN ('closed')) AS t_2 ON t_2.id = t_1.company_id\n\nJOIN (SELECT fr.company_id,\n             fr.is_first_round,\n             fr.is_last_round\n      FROM funding_round AS fr\n      GROUP BY fr.company_id, fr.is_first_round, fr.is_last_round\n      HAVING fr.is_first_round IN (1)\n         AND fr.is_last_round IN (1)) AS t_3 ON t_3.company_id = t_2.id;\n"

## Задача 15

Составьте таблицу, куда войдут уникальные пары с номерами сотрудников из предыдущей задачи и учебным заведением, которое окончил сотрудник.

In [15]:
'''
SELECT t_1.id AS unique_number_employee,
       t_4.instituition AS instituition_name
FROM (SELECT p.id,
             p.company_id
      FROM people AS p
      GROUP BY p.id, p.company_id) AS t_1
      
JOIN (SELECT c.id,
             c.name,
             c.status
      FROM company AS c
      GROUP BY c.id, c.name, c.status
      HAVING c.status IN ('closed')) AS t_2 ON t_2.id = t_1.company_id

JOIN (SELECT fr.company_id,
             fr.is_first_round,
             fr.is_last_round
      FROM funding_round AS fr
      GROUP BY fr.company_id, fr.is_first_round, fr.is_last_round
      HAVING fr.is_first_round IN (1)
         AND fr.is_last_round IN (1)) AS t_3 ON t_3.company_id = t_2.id

JOIN (SELECT e.instituition,
             e.person_id
      FROM education AS e
      GROUP BY e.instituition, e.person_id) AS t_4 ON t_4.person_id = t_1.id
'''

"\nSELECT t_1.id AS unique_number_employee,\n       t_4.instituition AS instituition_name\nFROM (SELECT p.id,\n             p.company_id\n      FROM people AS p\n      GROUP BY p.id, p.company_id) AS t_1\n      \nJOIN (SELECT c.id,\n             c.name,\n             c.status\n      FROM company AS c\n      GROUP BY c.id, c.name, c.status\n      HAVING c.status IN ('closed')) AS t_2 ON t_2.id = t_1.company_id\n\nJOIN (SELECT fr.company_id,\n             fr.is_first_round,\n             fr.is_last_round\n      FROM funding_round AS fr\n      GROUP BY fr.company_id, fr.is_first_round, fr.is_last_round\n      HAVING fr.is_first_round IN (1)\n         AND fr.is_last_round IN (1)) AS t_3 ON t_3.company_id = t_2.id\n\nJOIN (SELECT e.instituition,\n             e.person_id\n      FROM education AS e\n      GROUP BY e.instituition, e.person_id) AS t_4 ON t_4.person_id = t_1.id\n"

## Задача 16

Посчитайте количество учебных заведений для каждого сотрудника из предыдущего задания. При подсчёте учитывайте, что некоторые сотрудники могли окончить одно и то же заведение дважды.

In [16]:
'''
SELECT t_1.id AS unique_number_employee,
       COUNT(t_4.instituition) AS instituition_count
FROM (SELECT p.id,
             p.company_id
      FROM people AS p
      GROUP BY p.id, p.company_id) AS t_1
      
JOIN (SELECT c.id,
             c.name,
             c.status
      FROM company AS c
      GROUP BY c.id, c.name, c.status
      HAVING c.status IN ('closed')) AS t_2 ON t_2.id = t_1.company_id

JOIN (SELECT fr.company_id,
             fr.is_first_round,
             fr.is_last_round
      FROM funding_round AS fr
      GROUP BY fr.company_id, fr.is_first_round, fr.is_last_round
      HAVING fr.is_first_round IN (1)
         AND fr.is_last_round IN (1)) AS t_3 ON t_3.company_id = t_2.id

JOIN (SELECT e.instituition,
             person_id
       FROM education AS e) AS t_4 ON t_4.person_id = t_1.id
           
GROUP BY unique_number_employee
'''

"\nSELECT t_1.id AS unique_number_employee,\n       COUNT(t_4.instituition) AS instituition_count\nFROM (SELECT p.id,\n             p.company_id\n      FROM people AS p\n      GROUP BY p.id, p.company_id) AS t_1\n      \nJOIN (SELECT c.id,\n             c.name,\n             c.status\n      FROM company AS c\n      GROUP BY c.id, c.name, c.status\n      HAVING c.status IN ('closed')) AS t_2 ON t_2.id = t_1.company_id\n\nJOIN (SELECT fr.company_id,\n             fr.is_first_round,\n             fr.is_last_round\n      FROM funding_round AS fr\n      GROUP BY fr.company_id, fr.is_first_round, fr.is_last_round\n      HAVING fr.is_first_round IN (1)\n         AND fr.is_last_round IN (1)) AS t_3 ON t_3.company_id = t_2.id\n\nJOIN (SELECT e.instituition,\n             person_id\n       FROM education AS e) AS t_4 ON t_4.person_id = t_1.id\n           \nGROUP BY unique_number_employee\n"

## Задача 17

Дополните предыдущий запрос и выведите среднее число учебных заведений (всех, не только уникальных), которые окончили сотрудники разных компаний. Нужно вывести только одну запись, группировка здесь не понадобится.

In [17]:
'''
SELECT AVG(instituition_count)
FROM(SELECT t_1.id AS unique_number_employee,
            COUNT(t_4.instituition) AS instituition_count
      FROM (SELECT p.id,
                   p.company_id
            FROM people AS p
            GROUP BY p.id, p.company_id) AS t_1
            
      JOIN (SELECT c.id,
                   c.name,
                   c.status
            FROM company AS c
            GROUP BY c.id, c.name, c.status
            HAVING c.status IN ('closed')) AS t_2 ON t_2.id = t_1.company_id
      
      JOIN (SELECT fr.company_id,
                   fr.is_first_round,
                   fr.is_last_round
            FROM funding_round AS fr
            GROUP BY fr.company_id, fr.is_first_round, fr.is_last_round
            HAVING fr.is_first_round IN (1)
               AND fr.is_last_round IN (1)) AS t_3 ON t_3.company_id = t_2.id
      
      JOIN (SELECT e.instituition,
                   person_id
             FROM education AS e) AS t_4 ON t_4.person_id = t_1.id
                 
      GROUP BY unique_number_employee) AS t_5;
'''

"\nSELECT AVG(instituition_count)\nFROM(SELECT t_1.id AS unique_number_employee,\n            COUNT(t_4.instituition) AS instituition_count\n      FROM (SELECT p.id,\n                   p.company_id\n            FROM people AS p\n            GROUP BY p.id, p.company_id) AS t_1\n            \n      JOIN (SELECT c.id,\n                   c.name,\n                   c.status\n            FROM company AS c\n            GROUP BY c.id, c.name, c.status\n            HAVING c.status IN ('closed')) AS t_2 ON t_2.id = t_1.company_id\n      \n      JOIN (SELECT fr.company_id,\n                   fr.is_first_round,\n                   fr.is_last_round\n            FROM funding_round AS fr\n            GROUP BY fr.company_id, fr.is_first_round, fr.is_last_round\n            HAVING fr.is_first_round IN (1)\n               AND fr.is_last_round IN (1)) AS t_3 ON t_3.company_id = t_2.id\n      \n      JOIN (SELECT e.instituition,\n                   person_id\n             FROM education AS e) AS t_4 ON t_4.person_id = t_1.id\n                 \n      GROUP BY unique_number_employee) AS t_5;\n"

## Задача 18

Напишите похожий запрос: выведите среднее число учебных заведений (всех, не только уникальных), которые окончили сотрудники Socialnet.

In [18]:
'''
SELECT AVG(instituition_count)
FROM(SELECT t_1.id AS unique_number_employee,
            COUNT(t_4.instituition) AS instituition_count
      FROM (SELECT p.id,
                   p.company_id
            FROM people AS p
            GROUP BY p.id, p.company_id) AS t_1
            
      JOIN (SELECT c.id,
                   c.name,
                   c.status
            FROM company AS c
            GROUP BY c.id, c.name, c.status
            HAVING c.name IN ('Socialnet')) AS t_2 ON t_2.id = t_1.company_id

      JOIN (SELECT e.instituition,
                   person_id
             FROM education AS e) AS t_4 ON t_4.person_id = t_1.id
                 
      GROUP BY unique_number_employee) AS t_5;
'''

"\nSELECT AVG(instituition_count)\nFROM(SELECT t_1.id AS unique_number_employee,\n            COUNT(t_4.instituition) AS instituition_count\n      FROM (SELECT p.id,\n                   p.company_id\n            FROM people AS p\n            GROUP BY p.id, p.company_id) AS t_1\n            \n      JOIN (SELECT c.id,\n                   c.name,\n                   c.status\n            FROM company AS c\n            GROUP BY c.id, c.name, c.status\n            HAVING c.name IN ('Socialnet')) AS t_2 ON t_2.id = t_1.company_id\n\n      JOIN (SELECT e.instituition,\n                   person_id\n             FROM education AS e) AS t_4 ON t_4.person_id = t_1.id\n                 \n      GROUP BY unique_number_employee) AS t_5;\n"

## Задача 19

Составьте таблицу из полей:

* name_of_fund — название фонда;
* name_of_company — название компании;
* amount — сумма инвестиций, которую привлекла компания в раунде.

В таблицу войдут данные о компаниях, в истории которых было больше шести важных этапов, а раунды финансирования проходили с 2012 по 2013 год включительно.

In [19]:
'''
SELECT f.name AS name_of_fund, 
       C.name AS name_of_company, 
       fr.raised_amount AS amount
FROM investment AS i

JOIN company AS c ON i.company_id=c.id
JOIN fund AS f ON i.fund_id=f.id
JOIN funding_round AS fr ON i.funding_round_id = fr.id

WHERE EXTRACT(YEAR FROM fr.funded_at) BETWEEN 2012 AND 2013
  AND c.milestones > 6;
'''

'\nSELECT f.name AS name_of_fund, \n       C.name AS name_of_company, \n       fr.raised_amount AS amount\nFROM investment AS i\n\nJOIN company AS c ON i.company_id=c.id\nJOIN fund AS f ON i.fund_id=f.id\nJOIN funding_round AS fr ON i.funding_round_id = fr.id\n\nWHERE EXTRACT(YEAR FROM fr.funded_at) BETWEEN 2012 AND 2013\n  AND c.milestones > 6;\n'

## Задача 20

Выгрузите таблицу, в которой будут такие поля:

* название компании-покупателя;
* сумма сделки;
* название компании, которую купили;
* сумма инвестиций, вложенных в купленную компанию;
* доля, которая отображает, во сколько раз сумма покупки превысила сумму вложенных в компанию инвестиций, округлённая до ближайшего целого числа.

Не учитывайте те сделки, в которых сумма покупки равна нулю. Если сумма инвестиций в компанию равна нулю, исключите такую компанию из таблицы. 

Отсортируйте таблицу по сумме сделки от большей к меньшей, а затем по названию купленной компании в лексикографическом порядке. Ограничьте таблицу первыми десятью записями.

In [20]:
'''
SELECT company.name AS acquiring_company,
       t_2.price_amount,
       t_2.acquired_company,
       t_2.funding_total,
       ROUND(t_2.price_amount / t_2.funding_total)
FROM
(
    SELECT c.name AS acquired_company,
           c.funding_total,
           t_1.acquiring_company_id,
           t_1.price_amount
    FROM company AS c
    RIGHT JOIN (
                SELECT acquiring_company_id,
                       acquired_company_id,
                       price_amount
                FROM acquisition
                WHERE price_amount > 0
               ) AS t_1 ON c.id = t_1.acquired_company_id
 ) AS t_2 LEFT JOIN company ON company.id  = t_2.acquiring_company_id
WHERE t_2.funding_total > 0
ORDER BY t_2.price_amount DESC, t_2.acquired_company
LIMIT 10;
'''

'\nSELECT company.name AS acquiring_company,\n       t_2.price_amount,\n       t_2.acquired_company,\n       t_2.funding_total,\n       ROUND(t_2.price_amount / t_2.funding_total)\nFROM\n(\n    SELECT c.name AS acquired_company,\n           c.funding_total,\n           t_1.acquiring_company_id,\n           t_1.price_amount\n    FROM company AS c\n    RIGHT JOIN (\n                SELECT acquiring_company_id,\n                       acquired_company_id,\n                       price_amount\n                FROM acquisition\n                WHERE price_amount > 0\n               ) AS t_1 ON c.id = t_1.acquired_company_id\n ) AS t_2 LEFT JOIN company ON company.id  = t_2.acquiring_company_id\nWHERE t_2.funding_total > 0\nORDER BY t_2.price_amount DESC, t_2.acquired_company\nLIMIT 10;\n'

## Задача 21

Выгрузите таблицу, в которую войдут названия компаний из категории social, получившие финансирование с 2010 по 2013 год включительно. Проверьте, что сумма инвестиций не равна нулю. Выведите также номер месяца, в котором проходил раунд финансирования.

In [21]:
'''
SELECT  c.name AS social_co,
        EXTRACT (MONTH FROM fr.funded_at) AS funding_month
FROM company AS c

LEFT JOIN funding_round AS fr ON c.id = fr.company_id

WHERE c.category_code = 'social'
AND fr.funded_at BETWEEN '2010-01-01' AND '2013-12-31'
AND fr.raised_amount <> 0;
'''

"\nSELECT  c.name AS social_co,\n        EXTRACT (MONTH FROM fr.funded_at) AS funding_month\nFROM company AS c\n\nLEFT JOIN funding_round AS fr ON c.id = fr.company_id\n\nWHERE c.category_code = 'social'\nAND fr.funded_at BETWEEN '2010-01-01' AND '2013-12-31'\nAND fr.raised_amount <> 0;\n"

## Задача 22

Отберите данные по месяцам с 2010 по 2013 год, когда проходили инвестиционные раунды. Сгруппируйте данные по номеру месяца и получите таблицу, в которой будут поля:

* номер месяца, в котором проходили раунды;
* количество уникальных названий фондов из США, которые инвестировали в этом месяце;
* количество компаний, купленных за этот месяц;
* общая сумма сделок по покупкам в этом месяце.

In [22]:
'''
WITH
-- выбираем месяц инвестиционных раундов в 2010-2013 гг
tab1 AS (SELECT EXTRACT(MONTH FROM funded_at) AS month,
                id AS funding_round_id
                FROM funding_round
         WHERE EXTRACT(YEAR FROM funded_at) BETWEEN 2010 AND 2013
         ),

-- считаем кол-во купленных и общую сумму по сделкам за 2010-2013 гг в разрезе месяца
tab2 AS (SELECT EXTRACT(MONTH FROM acquired_at) AS month,
                COUNT(acquired_company_id) AS count_acquired,
                SUM(price_amount) AS total_amount
         FROM acquisition
         WHERE EXTRACT(YEAR FROM acquired_at) BETWEEN 2010 AND 2013
         GROUP BY EXTRACT(MONTH FROM acquired_at)
        ),

-- ищем фонды из США
tab3 AS (SELECT i.funding_round_id,
                f.name
        FROM investment AS i
        JOIN fund AS f ON f.id = i.fund_id
        WHERE fund_id IN (SELECT id
                          FROM fund
                          WHERE country_code LIKE 'USA')
        ),

tab4 AS (SELECT month,
                COUNT(DISTINCT name) AS count_USA
         FROM tab1 
         LEFT JOIN tab3 ON tab1.funding_round_id = tab3.funding_round_id
         GROUP BY month)
         
SELECT tab4.month,
       tab4.count_USA,
       tab2.count_acquired,
       tab2.total_amount
FROM tab4 
LEFT JOIN tab2 ON tab4.month = tab2.month;
'''

"\nWITH\n-- выбираем месяц инвестиционных раундов в 2010-2013 гг\ntab1 AS (SELECT EXTRACT(MONTH FROM funded_at) AS month,\n                id AS funding_round_id\n                FROM funding_round\n         WHERE EXTRACT(YEAR FROM funded_at) BETWEEN 2010 AND 2013\n         ),\n\n-- считаем кол-во купленных и общую сумму по сделкам за 2010-2013 гг в разрезе месяца\ntab2 AS (SELECT EXTRACT(MONTH FROM acquired_at) AS month,\n                COUNT(acquired_company_id) AS count_acquired,\n                SUM(price_amount) AS total_amount\n         FROM acquisition\n         WHERE EXTRACT(YEAR FROM acquired_at) BETWEEN 2010 AND 2013\n         GROUP BY EXTRACT(MONTH FROM acquired_at)\n        ),\n\n-- ищем фонды из США\ntab3 AS (SELECT i.funding_round_id,\n                f.name\n        FROM investment AS i\n        JOIN fund AS f ON f.id = i.fund_id\n        WHERE fund_id IN (SELECT id\n                          FROM fund\n                          WHERE country_code LIKE 'USA')\n        ),\n\ntab4 AS (SELECT month,\n                COUNT(DISTINCT name) AS count_USA\n         FROM tab1 \n         LEFT JOIN tab3 ON tab1.funding_round_id = tab3.funding_round_id\n         GROUP BY month)\n         \nSELECT tab4.month,\n       tab4.count_USA,\n       tab2.count_acquired,\n       tab2.total_amount\nFROM tab4 \nLEFT JOIN tab2 ON tab4.month = tab2.month;\n"

## Задача 23

Составьте сводную таблицу и выведите среднюю сумму инвестиций для стран, в которых есть стартапы, зарегистрированные в 2011, 2012 и 2013 годах. Данные за каждый год должны быть в отдельном поле. Отсортируйте таблицу по среднему значению инвестиций за 2011 год от большего к меньшему.

In [23]:
'''
WITH

total_11 AS (SELECT AVG(funding_total) AS total_2011,
                      country_code
               FROM company
               GROUP BY country_code,
               EXTRACT(YEAR FROM founded_at)
               HAVING EXTRACT(YEAR FROM founded_at) = 2011),
               
total_12 AS (SELECT AVG(funding_total) AS total_2012,
                      country_code
               FROM company
               GROUP BY country_code,
               EXTRACT(YEAR FROM founded_at)
               HAVING EXTRACT(YEAR FROM founded_at) = 2012),

total_13 AS (SELECT AVG(funding_total) AS total_2013,
                      country_code
               FROM company
               GROUP BY country_code,
               EXTRACT(YEAR FROM founded_at)
               HAVING EXTRACT(YEAR FROM founded_at) = 2013)

SELECT total_11.country_code,
       total_11.total_2011,
       total_12.total_2012,
       total_13.total_2013
FROM total_11 
INNER JOIN total_12 ON total_11.country_code = total_12.country_code
INNER JOIN total_13 ON total_11.country_code = total_13.country_code
ORDER BY total_11.total_2011 DESC;
'''

'\nWITH\n\ntotal_11 AS (SELECT AVG(funding_total) AS total_2011,\n                      country_code\n               FROM company\n               GROUP BY country_code,\n               EXTRACT(YEAR FROM founded_at)\n               HAVING EXTRACT(YEAR FROM founded_at) = 2011),\n               \ntotal_12 AS (SELECT AVG(funding_total) AS total_2012,\n                      country_code\n               FROM company\n               GROUP BY country_code,\n               EXTRACT(YEAR FROM founded_at)\n               HAVING EXTRACT(YEAR FROM founded_at) = 2012),\n\ntotal_13 AS (SELECT AVG(funding_total) AS total_2013,\n                      country_code\n               FROM company\n               GROUP BY country_code,\n               EXTRACT(YEAR FROM founded_at)\n               HAVING EXTRACT(YEAR FROM founded_at) = 2013)\n\nSELECT total_11.country_code,\n       total_11.total_2011,\n       total_12.total_2012,\n       total_13.total_2013\nFROM total_11 \nINNER JOIN total_12 ON total_11.country_code = total_12.country_code\nINNER JOIN total_13 ON total_11.country_code = total_13.country_code\nORDER BY total_11.total_2011 DESC;\n'